/*----------------------------------------------------
	port.h (v1.00)
	port-old.h
	'port header' (see chap 5) for DDC-Z
----------------------------------------------------*/

#ifndef _PORT_H
#define _PORT_H

#include "main.h"

/*----------------------------------------------------
	端口定义
-----------------------------------------------------*/

// 过流检测
sbit ElecMotor_overcurrent = P1^2;

// P2.2，P2.3，PIN13，PIN14, 锁信号
sbit MagentControl_1 = P2^2;
sbit MagentControl_2 = P2^3;

// P1.6, PIN5, 6次未解锁错误提示，红灯
sbit Generator_lock = P1^6;

// P0.1, PIN26, 1表示有接上锁内密码认证版，0表示未接上
sbit wire_broken = P0^1;

#endif
											
/*---------------------------------------------------
	end of file
----------------------------------------------------*/